{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Bachelor of Software Engineering",
      "department": "Software Engineering",
      "duration": "2018-2021",
      "school_name": "Lakehead University"
    },
    {
      "awards_achievements": null,
      "degree": "Technical Diploma in Software Engineering",
      "department": "Software Engineering",
      "duration": "2018-2019",
      "school_name": "Lakehead University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_KhanjanDabhi",
  "highlighted_projects": [
    {
      "description": "Developed an MRI brain tumour segmentation algorithm in Python using a supervised, fully convolutional neural network called UNet. Its architecture was modified using Tensorflow and extended to work with fewer training images to yield more precise segmentation. Exploratory Data Analysis, Normalization and Data Augmentation on 3D vectored MRI scans were performed using Python libraries such as Matplotlib, Nilearn, Nibable, Pandas and Numpy. Normalized images were used to train and test the neural network(UNet) generating the segmentation images. The images were stored on the local computer which can be used for further analysis. Concepts of convolution, max-pooling, flattening, activation and loss-functions were thoroughly understood. The Problem of managing computationally and resource expensive machine learning models for training as well as deployment was handled throughout this project by performing hyperparameter tuning in Jupyter Notebook as well as using divide and conquer methodology for training very large datasets.",
      "git_url": "https://github.com/KhanjanDabhi/MRI-Brain-Tumor-Segmentation",
      "name": "MRI-Brain-Tumor-Segmentation"
    },
    {
      "description": "Performed refactoring on a given Movie Rental System programmed in Java to operate on a command-line interface. Performed refactoring step-by-step to make it easier to add new code, fixed smelly code to make sure that the concepts of object-orientation are preserved/applied, recover parts of the system design by generating class diagrams of the system, making sure that all the unit tests passed after applying changes. Developed a strategy where refactoring is carried out in small steps, with the tests being run after each change to quickly recover from any faults introduced as part of the refactoring process.",
      "git_url": "https://github.com/KhanjanDabhi/Refactoring",
      "name": "Refactoring and Object-Oriented Design"
    },
    {
      "description": "Worked in a team of four to design a portable file manipulator which will operate on files for various operating systems. POFM was written in C, using standard commands and no system calls as the program had to be portable. This was tested on Windows, Linux and MacOS.",
      "git_url": "https://github.com/KhanjanDabhi/Concepts-of-Operating-Systems",
      "name": "Concepts of Operating Systems"
    },
    {
      "description": "This project was an analysis of various pre-trained and self-trained neural networks such as VGG16, ResNet50 and Mobile-Net. These models were compared for their classification accuracy in Python using Keras and TensorFlow. They were trained on the same dataset, which contained CT scans of lungs with and without an infection. Used Pandas, Numpy and Scipy, key concepts of machine learning for images were applied on the dataset such as data augmentation, adaptive histogram equalization, contrast-stretching and cross-validation. SKlearn was used to perform hyperparameter tuning on each of the models mentioned above, and changes in accuracy w.r.t. tuning were manually recorded. Effects of image segmentation on these models were also noted by performing un-supervised segmentation through K-means clustering. Quantitative analysis was done at the end from the collected data to generate a properly formatted report in LaTeX.",
      "git_url": "https://github.com/KhanjanDabhi/Applied-Computational-Intelligence",
      "name": "Applied Computational Intelligence"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a Linux Cluster Monitoring agent that allows users to keep track of machine specs and usage data across numerous Linux systems. The agent collects machine hardware information using Bash scripts, subsequently saved in a Docker-provisioned PostgreSQL database. Crontab is used to collect resource utilization data automatically, which may then be analyzed using SQL queries. All of the testings were done on a Google Cloud Platform virtual machine running CentOS7 distribution of Linux. Every script was manually checked to ensure that it met all of the requirements.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    }
  ],
  "name": "Khanjan Dabhi",
  "others": [
    {
      "bullets": [
        "Google Data Analytics Certificate"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Active member of the Budtender's Association of Canada (BTA)",
        "Organizing Competitive gaming matches"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Working on several projects that required the use of Linux, Bash, Docker, Postgres, Java, and Spring Boot. I employed the Scrum/Agile methodology with Git and Git Flow in every project. As a scrum leader, I assisted people with project-related challenges and led daily scrum meetings.",
      "duration": "2021-present",
      "title": "Software Developer"
    }
  ],
  "skills": {
    "competent": [
      "Keras",
      "Matplolib",
      "Nibable",
      "Nilearn",
      "Numpy",
      "Pandas",
      "Sklearn",
      "Tensorflow",
      "Virtulization",
      "Testing Procedures",
      "Data Modelling",
      "Exploratory Data Analysis",
      "Data Visulizations"
    ],
    "familiar": [
      "Statistical Analysis",
      "R",
      "OpenCL",
      "Google Cloud Platform",
      "Structural and Functional Testing"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git",
      "Python",
      "Data Analysis",
      "Docker"
    ]
  },
  "summary": "I am a recent graduate from Lakehead University with a degree in Software Engineering. Organized and dependable candidate successful at managing multiple priorities with a positive attitude. Willingness to take on added responsibilities to meet team goals. During my undergrad, I have studied performance analysis, compilers, algorithm design, operating systems, applied computational intelligence, parallel programming, machine learning and much more. I have worked on projects ranging from database management, scripting and refactoring Java programs to data modelling, data visualization and developing neural networks in Python. I am currently working at Jarvis to improve my skill sets as a developer while building challenging projects and applications using new technologies such as Docker, Springboot, Maven, REST API, RDBMS, etc. Consistency, taking responsibility for your own work/actions and being diligent are traits that help me become a better version of myself every day."
}
