{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Bachelor of Software Engineering",
      "department": "Software Engineering",
      "duration": "2018-2021",
      "school_name": "Lakehead University"
    },
    {
      "awards_achievements": null,
      "degree": "Technical Diploma in Software Engineering",
      "department": "Software Engineering",
      "duration": "2018-2019",
      "school_name": "Lakehead University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_KhanjanDabhi",
  "highlighted_projects": [
    {
      "description": "Developed a MRI brain tumor segmentation algorithm which would detect tumors from 3D MRI Images as a part of BRATS2020 Competition. Used Machine Learning for this project. The main goal of this project was to use of machine learning models outside a notebook enviorment while taking part in BRATS2020 challenge to detect tumor region in MRI images. Objectives learned include manipulation of 3D image data, using heavy and task specific deep neural networks such as UNet.",
      "git_url": "https://github.com/KhanjanDabhi/MRI-Brain-Tumor-Segmentation",
      "name": "MRI-Brain-Tumor-Segmentation"
    },
    {
      "description": "On given Movie Rental System, performed refactoring step-by-step to make it easier to add new code, fixed smelly code to make sure that the concepts of object-orientation are preserved/applied, recover parts of the system design by generating class diagrams of the system, made sure that all the unit test passed after applying changes.",
      "git_url": "https://github.com/KhanjanDabhi/Refactoring",
      "name": "Refactoring and Object-Oriented Design"
    },
    {
      "description": "Worked in a team of four to design a portable file manipulator which will operate on files for various operating systems. POFM was written in C, using standard commands and no system calls as the program had to be portable. This was tested on Windows, Linux and MacOS.",
      "git_url": "https://github.com/KhanjanDabhi/Concepts-of-Operating-Systems",
      "name": "Concepts of Operating Systems"
    },
    {
      "description": "Detect COVID-19 in CT scans for lungs. The dataset was obtained from Kaggle which contains images for lung CT scan with and without the infection. Key concepts of machine learning for images were used such as data augmentation, adaptive histogram equalization, contrast-stretching and cross validation. Effects of image segmentation on these models was also noted by performing un-supervised segmentation through K-means clustering. Pre-trained and self-trained neural networks were compared for this project such as VGG16, ResNet50 and Mobile-Net.",
      "git_url": "https://github.com/KhanjanDabhi/Applied-Computational-Intelligence",
      "name": "Applied Computational Intellegence"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a Linux Cluster Monitoring system(LCM). In this project, the agent can be used to record hardware specifications of several nodes/servers which are connected with each other internally through a switch and communicate with IPv4. LCM is mainly used by Cluster Administration Team which manages and plans the resources for servers in a company. The data is then stored into a RDBMS server which can be used by the team to generate more information. This can help the administration team monitor and support the cluster in a better way.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: In Progress",
        "JDBC App: In Progress",
        "Grep App: In Progress"
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "In Progress",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "In Progress",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "In Progress",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "In Progress",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "In Progress",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Khanjan Dabhi",
  "others": [
    {
      "bullets": [
        "Google Data Analytics Certificate"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Avid Plant Grower",
        "Competitive gaming"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Worked on Designing multiple projects as mentioned beore. Participated in Scrum meetings with peers daily and at the end of each sprint.",
      "duration": "2021-present",
      "title": "Software Developer"
    }
  ],
  "skills": {
    "competent": [
      "Python",
      "Statistical Analysis",
      "R",
      "OpenCL",
      "Data Analysis"
    ],
    "familiar": [
      "Virtulization",
      "Testing Procedures",
      "Data Modelling",
      "Exploratory Data Analysis",
      "Data Visulizations"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "Driven data science aficionado familiar with gathering, cleaning, and organizing data for use by technical and non-technical personnel. Progressed understanding of measurable, mathematical, and analytical procedures. Highly organized, motivated, and diligent with significant background in software engineering. Computer vision enthusiast. Ready to thrive in demanding digital intelligence processing environments. Well-informed on latest machine learning advancements. Ready to combine tireless hunger for new skills with desire to exploit cutting-edge data science technology."
}
